#include <NKP_ONE.h>   //เรียกใช้ชุดคำสั่งทั้งหมด
void setup() {
  NKP_ONE();     //ประกาศใช้ชุดคำสั่ง
  IO15();       //รอจนกว่าจะกด SW1 เพื่อทำงาน

}


void loop() {
  out(14,1);       //สั่งการทำงาน digital ให้ส่งค่าออกไปยังขาที่ 14 ให้เป็นสถานะ HIGH
  delay(500);     //หน่วงเวลา 500 ms
  out(14,0);      //สั่งการทำงาน digital ให้ส่งค่าออกไปยังขาที่ 14 ให้เป็นสถานะ LOW
  delay(500);     //หน่วงเวลา 500 ms

  out(27,in(26));    // สั่งการทำงานขา digital ที่ 26 ให้สถานะ เป็นค่าที่ได้รับจากช่อง digital ที่ 26

}
