#include <NKP_ONE.h>   //เรียกใช้ชุดคำสั่งทั้งหมด
void setup() {
  NKP_ONE();     //ประกาศใช้ชุดคำสั่ง
  IO15();       //รอจนกว่าจะกด SW1 เพื่อทำงาน

}

void loop() {
  set_oled_clear();    //เคลียหน้าจอ
  set_oled(0,0,"analogA0 = ");  //แสดงผลคำว่า "analogA0 = " ขึ้นที่หน้าจอ คอลัมที่ 0  บรรทัด ที่ 0
  set_oled(70,0,analog(A0));  //แสดงผลค่าที่ได้รับจาก analog ช่องที่ A0 ขึ้นที่หน้าจอ คอลัมที่ 40  บรรทัด ที่ 0

  int data = analog(A1);   //เก็บค่าที่อ่านได้จาก Analog ช่องที่ A1 ลงไปยังตัวแปรชนิดตัวเลข ชื่อ data
  set_oled(0,10,"analogA1 = ");  //แสดงผลคำว่า "analogA1 = " ขึ้นที่หน้าจอ คอลัมที่ 0  บรรทัด ที่ 10
  set_oled(70,10,data);  //แสดงผลค่าจากตัวแปร data ขึ้นที่หน้าจอ คอลัมที่ 40  บรรทัด ที่ 10
  
  delay(1);           //หน่วงเวลา  0.001 วินาที
  
}
