#include <NKP_ONE.h>   //เรียกใช้ชุดคำสั่งทั้งหมด
void setup() {
  NKP_ONE();     //ประกาศใช้ชุดคำสั่ง
  IO15();       //รอจนกว่าจะกด SW1 เพื่อทำงาน
  beep();

}

void loop() {
  motor(1,50);   //สั่งมอเตอร์ 1 เดินหน้า ทำงานด้วยความเร็ว 50 % ของแบตเตอร์รี่
  motor(2,100);   //สั่งมอเตอร์ 2 เดินหน้า ทำงานด้วยความเร็ว 100 % ของแบตเตอร์รี่
  servo(1,0);
  servo(2,0);
  servo(3,0);
  servo(4,0);
  delay(1000);    //หน่วงเวลา 1 วินาที
  motor(1,-100);  //สั่งมอเตอร์ 1 ถอยหลัง ทำงานด้วยความเร็ว 100 % ของแบตเตอร์รี่
  motor(2,-50);  //สั่งมอเตอร์ 2 ถอยหลัง ทำงานด้วยความเร็ว 50 % ของแบตเตอร์รี่
  servo(1,90);
  servo(2,90);
  servo(3,90);
  servo(4,90);
  delay(1000);   //หน่วงเวลา 1 วินาที 

  //หรือ

  motor_s(1,100);  //เมื่อเบรคมอเตอร์จะล็อคทำให้ระยะการเบรคนั้นสั้นลง
  motor_s(2,100);  // แต่ไม่เหมาะกับการแท็กเส้น
  servo(1,180);
  servo(2,180);
  servo(3,180);
  servo(4,180);
  delay(1000);

}
